# Contents

* [DataFrames](#DataFrames)
* [Selection and Indexing](#Selection-and-Indexing)
* [Removing Columns or Rows (Drop)](#Removing-Columns-or-Rows-(Drop))
* [Conditional Selection](#Conditional-Selection)
* [More Index Details](#More-Index-Details)
* [Multi-Index and Index Hierarchy](#Multi-Index-and-Index-Hierarchy)
* [Missing Data](#Missing-Data)
    * [isnull](#isnull)
    * [Dropna](#Dropna)
    * [Fillna](#Fillna)
* [Groupby](#Groupby)
* [Describe](#Describe)
    * [Mean](#Mean)
    * [Standard Deviation](#Standard-Deviation)
    * [Min](#Min)
    * [Max](#Max)
    * [Count](#Count)
* [Merging, Joining, and Concatenating](#Merging,-Joining,-and-Concatenating)
    * [Concatenation](#Concatenation)
    * [Merging](#Merging)
    * [Joining](#Joining)
* [Operations](#Operations)
    * [Info on Unique Values](#Info-on-Unique-Values)
    * [Selecting Data](#Selecting-Data)
    * [Applying Functions](#Applying-Functions)
* [Other Functions](#Other-Functions)
    * [Sum](#Sum)
    * [Del](#Del)
    * [Sort Values](#Sort-Values)
    * [Between](#Between)
    * [Map](#Map)
    * [Replace](#Replace)
    * [Pivot Table](#Pivot-Table)
    * [Boxplot](#Boxplot)
    * [Melt](#Melt)
    * [Pivot](#Pivot)
    * [Unstack](#Unstack)
    * [Swaplevel](#Swaplevel)
    * [Astype](#Astype)
* [Data Input and Output](#Data-Input-and-Output)
    * [CSV](#CSV)
        * [CSV Input](#CSV-Input)
        * [CSV Output](#CSV-Output)
    * [Excel](#Excel)
        * [Excel Input](#Excel-Input)
        * [Excel Output](#Excel-Output)
    * [HTML](#HTML)
        * [HTML Input](#HTML-Input)
* [Referans Link](#Referans-Link)

In [1]:
import numpy as np
import pandas as pd

## DataFrames

In [2]:
from numpy.random import randn
np.random.seed(101) # random sürekli olarak aynı değerleri döndürecektir.
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [3]:
df.info() #DataFrame hakkında bilgi verir.

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
W    5 non-null float64
X    5 non-null float64
Y    5 non-null float64
Z    5 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

## Selection and Indexing

In [4]:
df.columns

Index([u'W', u'X', u'Y', u'Z'], dtype='object')

In [5]:
df.index

Index([u'A', u'B', u'C', u'D', u'E'], dtype='object')

In [6]:
df["W"]
#df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
df[['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [8]:
df[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [9]:
df.loc[['A']]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [10]:
df.loc['C':]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df.iloc[[2]] #2. indeksli satırı yazdırır.

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [12]:
df.loc['B','Y'] # B satırı Y sütununun değeri

-0.8480769834036315

In [13]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [14]:
df.index[[1,2]]

Index([u'B', u'C'], dtype='object')

In [15]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

## Removing Columns or Rows (Drop)

In [16]:
df.drop('new',axis=1) #axis=0 satır, axis=1 sütun

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df #inplace defalt olarak false'tur. Gerçekte silmez.

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

## Conditional Selection

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [22]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [25]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

## More Index Details

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.reset_index() #indeks değerlerini 0 dan oluşturur.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
newind = 'CA NY WY OR CO'.split()
df["States"] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [30]:
df.set_index('States') #index değerlerini istenilen sütun ile değiştirir.

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [31]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [32]:
df.set_index('States',inplace=True)
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

In [33]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3] 
hier_index = list(zip(outside,inside)) #iki listeyi birleştirdik.

print hier_index

hier_index = pd.MultiIndex.from_tuples(hier_index) #çoklu label için satır ve sütun oluşturdu.

print hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [34]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [35]:
df.loc['G1']  #G1 grubunu alır

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [36]:
df.loc['G1'].loc[[1]] #G1 grubunun 1. indeksli satırını alır

          A         B
1  0.302665  1.693723

In [37]:
df.index.names #indeks isimlerini verir.

FrozenList([None, None])

In [38]:
df.index.names = ['Group','Num'] #indeks'leri isimlendirdik.
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [39]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [40]:
df.xs(['G1',1])

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

In [41]:
df.xs(1,level='Num') # 1 indeks'li satırları (tüm  gruplardaki) yazdıdır.

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

## Missing Data

In [42]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[np.nan,4,np.nan],
                  'C':[5,2,3],
                  'D':[np.nan,5,np.nan]})
df

     A    B  C    D
0  1.0  NaN  5  NaN
1  2.0  4.0  2  5.0
2  NaN  NaN  3  NaN

### isnull

In [43]:
df.isnull() #null eleman var mı kontrol eder.

       A      B      C      D
0  False   True  False   True
1  False  False  False  False
2   True   True  False   True

### Dropna

In [44]:
df.dropna()  #nan içermeyen değerleri getirir.

     A    B  C    D
1  2.0  4.0  2  5.0

In [45]:
df.dropna(axis=1) #sütun başında nan içermeyen değerleri getirir.

   C
0  5
1  2
2  3

In [46]:
df.dropna(thresh=2) #thresh miktarından az nan değerleri alır.

     A    B  C    D
0  1.0  NaN  5  NaN
1  2.0  4.0  2  5.0

### Fillna

In [47]:
df.fillna(value='boş') #Nan değerleri değiştirir.

     A    B  C    D
0    1  boş  5  boş
1    2    4  2    5
2  boş  boş  3  boş

In [48]:
df['A'].fillna(value=df['A'].mean(), inplace=True) #eksik veriye A sütunun ortalamasını ekledik.
df

     A    B  C    D
0  1.0  NaN  5  NaN
1  2.0  4.0  2  5.0
2  1.5  NaN  3  NaN

## Groupby

In [49]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Sales2':[200,120,340,124,243,400]}

In [50]:
df = pd.DataFrame(data)
df

  Company   Person  Sales  Sales2
0    GOOG      Sam    200     200
1    GOOG  Charlie    120     120
2    MSFT      Amy    340     340
3    MSFT  Vanessa    124     124
4      FB     Carl    243     243
5      FB    Sarah    350     400

In [51]:
by_comp = df.groupby('Company')

## Describe

### Mean

In [52]:
by_comp.describe() #Tüm özelikleri tablo olarak listeler.

        Sales                                                         Sales2  \
        count   mean         std    min     25%    50%     75%    max  count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0    2.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0    2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0    2.0


          mean         std    min     25%    50%     75%    max
Company
FB       321.5  111.015765  243.0  282.25  321.5  360.75  400.0
GOOG     160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT     232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [53]:
by_comp.describe().T

Company               FB        GOOG        MSFT
Sales  count    2.000000    2.000000    2.000000
       mean   296.500000  160.000000  232.000000
       std     75.660426   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    269.750000  140.000000  178.000000
       50%    296.500000  160.000000  232.000000
       75%    323.250000  180.000000  286.000000
       max    350.000000  200.000000  340.000000
Sales2 count    2.000000    2.000000    2.000000
       mean   321.500000  160.000000  232.000000
       std    111.015765   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    282.250000  140.000000  178.000000
       50%    321.500000  160.000000  232.000000
       75%    360.750000  180.000000  286.000000
       max    400.000000  200.000000  340.000000

In [54]:
by_comp.mean() #ortalama

         Sales  Sales2
Company
FB       296.5   321.5
GOOG     160.0   160.0
MSFT     232.0   232.0

### Standard Deviation

In [55]:
by_comp.std() #standart sapma

              Sales      Sales2
Company
FB        75.660426  111.015765
GOOG      56.568542   56.568542
MSFT     152.735065  152.735065

### Min

In [56]:
by_comp.min() #minimum değer

          Person  Sales  Sales2
Company
FB          Carl    243     243
GOOG     Charlie    120     120
MSFT         Amy    124     124

### Max

In [57]:
by_comp.max() #maximum değer

          Person  Sales  Sales2
Company
FB         Sarah    350     400
GOOG         Sam    200     200
MSFT     Vanessa    340     340

### Count

In [58]:
by_comp.count() #grubun kaç elemanı var

         Person  Sales  Sales2
Company
FB            2      2       2
GOOG          2      2       2
MSFT          2      2       2

## Merging, Joining, and Concatenating

In [59]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [60]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                  index=[4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

### Concatenation

In [61]:
pd.concat([df1,df2],axis=0,ignore_index=True) #Dataframe'leri dikey birleştirir.

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [62]:
pd.concat([df1,df2],axis=1) #Dataframe'leri yatay birleştirir.

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

### Merging

In [63]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

print left

right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

print right

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3
    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [64]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [65]:
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                    'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})
print left

right = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                    'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})
print right

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1
    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [66]:
pd.merge(left,right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [67]:
pd.merge(left,right,how='outer',on=['key1','key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [68]:
pd.merge(left,right,how='right',on=['key1','key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [69]:
pd.merge(left,right,how='left',on=['key1','key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

### Joining

In [70]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

print left

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

print right

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [71]:
left.join(right) #left dataframe'ine right datafram'ini ekler.

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

## Operations

In [72]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6],
                  'col2':[444,555,666,444,333,777],
                  'col3':['a','b','c','d','e','f']})
df

   col1  col2 col3
0     1   444    a
1     2   555    b
2     3   666    c
3     4   444    d
4     5   333    e
5     6   777    f

In [73]:
df.head() #Dataframe'in ilk 5 satırını gösterir.

   col1  col2 col3
0     1   444    a
1     2   555    b
2     3   666    c
3     4   444    d
4     5   333    e

In [74]:
df.tail() #Dataframe'in son 5 satırını gösterir.

   col1  col2 col3
1     2   555    b
2     3   666    c
3     4   444    d
4     5   333    e
5     6   777    f

### Info on Unique Values

In [75]:
df['col2'].unique() #Farlı değerleri listeler.

array([444, 555, 666, 333, 777])

In [76]:
df['col2'].nunique() #Kaç adet faklıdeğer olduğunu verir.

5

In [77]:
df['col2'].value_counts() #hangi değerneden kaç adet olduğunu verir.

444    2
333    1
555    1
666    1
777    1
Name: col2, dtype: int64

### Selecting Data

In [78]:
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444    d

### Applying Functions

In [79]:
def times2(x):
    return x**2

In [80]:
df['col1'].apply(times2) #Tüm elemanları fonksiyona gönderir.

0     1
1     4
2     9
3    16
4    25
5    36
Name: col1, dtype: int64

In [81]:
df['col3'].apply(len) #elemanlarının uzunluklarını verir.

0    1
1    1
2    1
3    1
4    1
5    1
Name: col3, dtype: int64

## Other Functions

### Sum

In [82]:
df['col1'].sum() #elemanların toplamını verir.

21

### Del

In [83]:
del df['col1'] #col1 sütununu siler.
df

   col2 col3
0   444    a
1   555    b
2   666    c
3   444    d
4   333    e
5   777    f

### Sort Values

In [84]:
df.sort_values(by='col2') #col2'ye göre sıralama yapar.

   col2 col3
4   333    e
0   444    a
3   444    d
1   555    b
2   666    c
5   777    f

In [85]:
df = pd.DataFrame({'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
                   'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
                   'Sales':[200,120,340,124,243,350],
                    'Sales2':[200,120,340,124,243,400]},
                    index=['K0','K1','K2','K3','K4','K5'])
df

   Company   Person  Sales  Sales2
K0    GOOG      Sam    200     200
K1    GOOG  Charlie    120     120
K2    MSFT      Amy    340     340
K3    MSFT  Vanessa    124     124
K4      FB     Carl    243     243
K5      FB    Sarah    350     400

### Between

In [86]:
df[df['Sales'].between(100,200)]

   Company   Person  Sales  Sales2
K0    GOOG      Sam    200     200
K1    GOOG  Charlie    120     120
K3    MSFT  Vanessa    124     124

### Map

In [87]:
df['Person'].map({'Sam':True,'Amy':False})

K0     True
K1      NaN
K2    False
K3      NaN
K4      NaN
K5      NaN
Name: Person, dtype: object

### Replace

In [88]:
df['Person'] = df['Person'].replace(['Sam','Charlie','Carl'],'Amy')
df

   Company   Person  Sales  Sales2
K0    GOOG      Amy    200     200
K1    GOOG      Amy    120     120
K2    MSFT      Amy    340     340
K3    MSFT  Vanessa    124     124
K4      FB      Amy    243     243
K5      FB    Sarah    350     400

 ### Pivot Table

In [89]:
df.pivot_table(index='Person', columns='Company', values='Sales', aggfunc='mean')

Company     FB   GOOG   MSFT
Person
Amy      243.0  160.0  340.0
Sarah    350.0    NaN    NaN
Vanessa    NaN    NaN  124.0

### Boxplot

In [90]:
import matplotlib.pyplot as plt

df = pd.DataFrame(np.random.randn(10, 2),
                  columns=['Col1', 'Col2'])

df['X'] = pd.Series(['A', 'A', 'A', 'A', 'A',
                      'B', 'B', 'B', 'B', 'B'])

#data icerisindeki median dağılımını gösterir. (max, 75%,orta nokta, 25%, min) 
#1.5*(orta nokta - 75%) ayrık noktayı verir. örneğin [1 1 1 1000] dizinde ayrık nokta 1000 değeridir.
df.boxplot(by='X') 
#df.boxplot(column='Col1')
df.boxplot(column='Col1',by='X')
plt.show()

### Melt

In [91]:
df = pd.DataFrame(np.random.randn(10, 2),
                  columns=['Col1', 'Col2'])

df['X'] = pd.Series(['A', 'B', 'C', 'D', 'E',
                      'A2', 'B2', 'C2', 'D2', 'E2'])

df.head()

       Col1      Col2  X
0  0.147027 -0.479448  A
1  0.558769  1.024810  B
2 -0.925874  1.862864  C
3 -1.133817  0.610478  D
4  0.386030  2.084019  E

In [92]:
melted = pd.melt(frame=df.head(), id_vars = 'X', value_vars= ['Col1','Col2']) #data columlarını birleştirme için kullanılır.
melted

   X variable     value
0  A     Col1  0.147027
1  B     Col1  0.558769
2  C     Col1 -0.925874
3  D     Col1 -1.133817
4  E     Col1  0.386030
5  A     Col2 -0.479448
6  B     Col2  1.024810
7  C     Col2  1.862864
8  D     Col2  0.610478
9  E     Col2  2.084019

### Pivot

In [93]:
melted.pivot(index = 'X', columns = 'variable',values='value') #birleştirilen colum'ları ayrımak için kullanılır. 
#data nameleri ('X') içerisinde tekrarlayan veriler bulunmamalıdır.

variable      Col1      Col2
X
A         0.147027 -0.479448
B         0.558769  1.024810
C        -0.925874  1.862864
D        -1.133817  0.610478
E         0.386030  2.084019

In [94]:
dic = {"treatment":["A","A","B","B"],"gender":["F","M","F","M"],"response":[10,45,5,9],"age":[15,4,72,65]}
df = pd.DataFrame(dic)
df

   age gender  response treatment
0   15      F        10         A
1    4      M        45         A
2   72      F         5         B
3   65      M         9         B

In [95]:
df.pivot(index="treatment",columns = "gender",values="response")

gender      F   M
treatment
A          10  45
B           5   9

In [96]:
df1 = df.set_index(["treatment","gender"])
df1

                  age  response
treatment gender
A         F        15        10
          M         4        45
B         F        72         5
          M        65         9

### Unstack

In [97]:
df1.unstack(level=0)

          age     response
treatment   A   B        A  B
gender
F          15  72       10  5
M           4  65       45  9

In [98]:
df1.unstack(level=1)

          age     response
gender      F   M        F   M
treatment
A          15   4       10  45
B          72  65        5   9

### Swaplevel

In [99]:
df1

                  age  response
treatment gender
A         F        15        10
          M         4        45
B         F        72         5
          M        65         9

In [100]:
df2 = df1.swaplevel(0,1)
df2

                  age  response
gender treatment
F      A           15        10
M      A            4        45
F      B           72         5
M      B           65         9

### Astype

In [101]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
age          4 non-null int64
gender       4 non-null object
response     4 non-null int64
treatment    4 non-null object
dtypes: int64(2), object(2)
memory usage: 200.0+ bytes

   age gender  response treatment
0   15      F        10         A
1    4      M        45         A
2   72      F         5         B
3   65      M         9         B

In [102]:
df.gender = df.gender.astype('category') #değişken türleri değiştirilebilir.
df.response = df.response.astype('float')
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
age          4 non-null int64
gender       4 non-null category
response     4 non-null float64
treatment    4 non-null object
dtypes: category(1), float64(1), int64(1), object(1)
memory usage: 268.0+ bytes

   age gender  response treatment
0   15      F      10.0         A
1    4      M      45.0         A
2   72      F       5.0         B
3   65      M       9.0         B

## Data Input and Output

### CSV

#### CSV Input

In [103]:
df = pd.read_csv('datasets/PANDAS_example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### CSV Output

In [104]:
df.to_csv('datasets/PANDAS_example2',index=False)

In [105]:
df.to_csv('datasets/PANDAS_example3',index=True)

### Excel

#### Excel Input

In [106]:
a = pd.read_excel('datasets/PANDAS_Excel_Sample.xlsx', sheet_name='Sheet1')
a

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### Excel Output

In [107]:
df.to_excel('datasets/Excel_Sample2.xlsx', sheet_name='Sheet2')

### HTML

#### HTML Input

In [108]:
df = pd.read_html('http://finans.mynet.com/')
df[0]

   Hisse  Fiyat  Fark%   Saat
0  PKART  270.0   2000  04:37
1  ISATR   45.9   1916  12:55
2  OZGYO  235.0   1750  04:37
3  GEREL  353.0   1461  04:37
4  IEYHO   84.0   1351  04:37

## Referans Link

### https://pandas.pydata.org/pandas-docs/stable/tutorials.html